$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '14.2.0',
          'Headers' => {
                         'af-mctp.h' => 1,
                         'base.h' => 1,
                         'bios.h' => 1,
                         'bios_table.h' => 1,
                         'control.h' => 1,
                         'file_io.h' => 1,
                         'firmware_fd.h' => 1,
                         'firmware_update.h' => 1,
                         'fru.h' => 1,
                         'host.h' => 1,
                         'instance-id.h' => 1,
                         'mctp-demux.h' => 1,
                         'pdr.h' => 1,
                         'platform.h' => 1,
                         'pldm.h' => 1,
                         'pldm_types.h' => 1,
                         'transport.h' => 1,
                         'utils.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libpldm.so.0.11.0',
          'LibraryVersion' => '0.11.0',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'af-mctp.c' => 1,
                         'bios_table.c' => 1,
                         'instance-id.c' => 1,
                         'mctp-demux.c' => 1,
                         'pdr.c' => 1

                                                  'pldm_pdr_get_terminus_handle' => 1,
                                                  'pldm_pdr_init' => 1,
                                                  'pldm_pdr_record_is_remote' => 1,
                                                  'pldm_pdr_remove_fru_record_set_by_rsi' => 1,
                                                  'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
                                                  'pldm_pdr_remove_remote_pdrs' => 1,
                                                  'pldm_pdr_update_TL_pdr' => 1,
                                                  'pldm_platform_cper_event_event_data' => 1,
                                                  'pldm_recv' => 1,
                                                  'pldm_recv_any' => 1,
                                                  'pldm_send' => 1,
                                                  'pldm_send_recv' => 1,
                                                  'pldm_transport_af_mctp_bind' => 1,
                                                  'pldm_transport_af_mctp_core' => 1,
                                                  'pldm_transport_af_mctp_destroy' => 1,
                                                  'pldm_transport_af_mctp_init' => 1,
                                                  'pldm_transport_af_mctp_init_pollfd' => 1,
                                                  'pldm_transport_af_mctp_map_tid' => 1,
                                                  'pldm_transport_af_mctp_unmap_tid' => 1,
                                                  'pldm_transport_mctp_demux_core' => 1,
                                                  'pldm_transport_mctp_demux_destroy' => 1,
                                                  'pldm_transport_mctp_demux_init' => 1,
                                                  'pldm_transport_mctp_demux_init_pollfd' => 1,
                                                  'pldm_transport_mctp_demux_map_tid' => 1,
                                                  'pldm_transport_mctp_demux_unmap_tid' => 1,
                                                  'pldm_transport_poll' => 1,
                                                  'pldm_transport_recv_msg' => 1,
                                                  'pldm_transport_send_msg' => 1,
                                                  'pldm_transport_send_recv_msg' => 1,
                                                  'pldm_transport_test_core' => 1,
                                                  'pldm_transport_test_destroy' => 1,
                                                  'pldm_transport_test_init' => 1,
                                                  'pldm_transport_test_init_pollfd' => 1,
                                                  'unpack_pldm_header' => 1,
                                                  'ver2str' => 1
                                                }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '46' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '53' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '60' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '67' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '74' => {
                                    'Name' => 'signed char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '81' => {
                                    'BaseType' => '46',
                                    'Header' => 'types.h',
                                    'Line' => '38',
                                    'Name' => '__uint8_t',
                                    'PrivateABI' => 1,
                                    'Size' => '1',
                                    'Type' => 'Typedef'
                                  },
                          '93' => {
                                    'Name' => 'short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '100' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '107' => {
                                     'BaseType' => '60',
                                     'Header' => 'types.h',
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '119' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '126' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '128' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '135' => {
                                     'BaseType' => '81',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '24',
                                     'Name' => 'uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '147' => {
                                     'BaseType' => '107',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '26',
                                     'Name' => 'uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '159' => {
                                     'BaseType' => '147',
                                     'Name' => 'uint32_t const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '164' => {
                                     'BaseType' => '67',
                                     'Header' => 'stddef.h',
                                     'Line' => '214',
                                     'Name' => 'size_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '190' => {
                                     'Header' => 'pldm_types.h',
                                     'Line' => '9',
                                     'Name' => 'anon-struct-pldm_types.h-9',
                                     'Size' => '1',
                                     'Type' => 'Struct'
                                   },
                          '344' => {
                                     'Header' => 'pldm_types.h',
                                     'Line' => '19',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'byte',
                                                          'offset' => '0',
                                                          'type' => '135'
                                                        },
                                                 '1' => {
                                                          'name' => 'bits',
                                                          'offset' => '0',
                                                          'type' => '190'
                                                        }
                                               },
                                     'Name' => 'union bitfield8_t',
                                     'Size' => '1',
                                     'Type' => 'Union'
                                   },
                          '356' => {
                                     'BaseType' => '344',
                                     'Name' => 'bitfield8_t const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '361' => {
                                     'Header' => 'pldm_types.h',
                                     'Line' => '25',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'alpha',
                                                          'offset' => '0',
                                                          'type' => '135'
                                                        },
                                                 '1' => {
                                                          'name' => 'update',
                                                          'offset' => '1',
                                                          'type' => '135'
                                                        },
                                                 '2' => {
                                                          'name' => 'minor',
                                                          'offset' => '2',
                                                          'type' => '135'
                                                        },
                                                 '3' => {
                                                          'name' => 'major',
                                                          'offset' => '3',
                                                          'type' => '135'
                                                        }
                                               },
                                     'Name' => 'struct pldm_version',
                                     'Size' => '4',
                                     'Type' => 'Struct'
                                   },
                          '427' => {
                                     'BaseType' => '361',
                                     'Header' => 'pldm_types.h',
                                     'Line' => '30',
                                     'Name' => 'ver32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '439' => {
                                     'BaseType' => '427',
                                     'Name' => 'ver32_t const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '444' => {
                                     'Name' => 'float',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '789' => {
                                     'Header' => 'base.h',
                                     'Line' => '97',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'PLDM_RESPONSE',
                                                          'value' => '0'
                                                        },
                                                 '1' => {
                                                          'name' => 'PLDM_REQUEST',
                                                          'value' => '1'
                                                        },
                                                 '2' => {
                                                          'name' => 'PLDM_RESERVED',
                                                          'value' => '2'
                                                        },
                                                 '3' => {
                                                          'name' => 'PLDM_ASYNC_REQUEST_NOTIFY',
                                                          'value' => '3'
                                                        }
                                               },
                                     'Name' => 'enum MessageType',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '801' => {
                                     'Header' => 'base.h',
                                     'Line' => '146',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'command',
                                                          'offset' => '2',
                                                          'type' => '135'
                                                        }
                                               },
                                     'Name' => 'struct pldm_msg_hdr',
                                     'Size' => '3',
                                     'Type' => 'Struct'
                                   },
                          '912' => {
                                     'BaseType' => '801',
                                     'Name' => 'struct pldm_msg_hdr const',
                                     'Size' => '3',
                                     'Type' => 'Const'
                                   },
                          '917' => {
                                     'Header' => 'base.h',
                                     'Line' => '179',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'hdr',
                                                          'offset' => '0',
                                                          'type' => '801'
                                                        },
                                                 '1' => {
                                                          'name' => 'payload',
                                                          'offset' => '3',
                                                          'type' => '962'
                                                        }
                                               },
                                     'Name' => 'struct pldm_msg',
                                     'Size' => '4',
                                     'Type' => 'Struct'
                                   },
                          '957' => {
                                     'BaseType' => '917',
                                     'Name' => 'struct pldm_msg const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '962' => {
                                     'BaseType' => '135',
                                     'Name' => 'uint8_t[1]',
                                     'Size' => '1',
                                     'Type' => 'Array'
                                   },
                          '978' => {
                                     'Header' => 'base.h',
                                     'Line' => '246',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'msg_type',
                                                          'offset' => '0',
                                                          'type' => '789'
                                                        },
                                                 '1' => {
                                                          'name' => 'instance',
                                                          'offset' => '4',
                                                          'type' => '135'
                                                        },
                                                 '2' => {
                                                          'name' => 'pldm_type',
                                                          'offset' => '5',
                                                          'type' => '135'
                                                        },
                                                 '3' => {
                                                          'name' => 'command',
                                                          'offset' => '6',
                                                          'type' => '135'
                                                        },
                                                 '4' => {
                                                          'name' => 'completion_code',
                                                          'offset' => '7',
                                                          'type' => '135'
                                                        }
                                               },
                                     'Name' => 'struct pldm_header_info',
                                     'Size' => '8',
                                     'Type' => 'Struct'
                                   },
                          '1057' => {
                                      'BaseType' => '978',
                                      'Name' => 'struct pldm_header_info const',
                                      'Size' => '8',
                                      'Type' => 'Const'
                                    },
                          '1186' => {
                                      'BaseType' => '135',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1191' => {
                                      'Header' => 'control-internal.h',
                                      'Line' => '16',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'versions',
                                                           'offset' => '0',
                                                           'type' => '1262'
                                                         },
                                                  '1' => {
                                                           'name' => 'versions_count',
                                                           'offset' => '8',
                                                           'type' => '135'
                                                         },
                                                  '2' => {
                                                           'name' => 'commands',
                                                           'offset' => '22',
                                                           'type' => '1268'
                                                         },
                                                  '3' => {
                                                           'name' => 'pldm_type',
                                                           'offset' => '36',
                                                           'type' => '135'
                                                         }
                                                },
                                      'Name' => 'struct pldm_type_versions',
                                      'PrivateABI' => 1,
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '1262' => {
                                      'BaseType' => '1267',
                                      'Name' => 'void const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1267' => {
                                      'BaseType' => '1',
                                      'Name' => 'void const',
                                      'Type' => 'Const'
                                    },
                          '1268' => {
                                      'BaseType' => '356',
                                      'Name' => 'bitfield8_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1273' => {
                                      'Header' => 'control-internal.h',
                                      'Line' => '29',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'types',
                                                           'offset' => '0',
                                                           'type' => '1300'
                                                         }
                                                },
                                      'Name' => 'struct pldm_control',
                                      'PrivateABI' => 1,
                                      'Size' => '192',
                                      'Type' => 'Struct'
                                    },
                          '1300' => {
                                      'BaseType' => '1191',
                                      'Name' => 'struct pldm_type_versions[6]',
                                      'Size' => '192',
                                      'Type' => 'Array'
                                    },
                          '1443' => {
                                      'BaseType' => '917',
                                      'Name' => 'struct pldm_msg*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1522' => {
                                      'BaseType' => '957',
                                      'Name' => 'struct pldm_msg const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1527' => {
                                      'BaseType' => '427',
                                      'Name' => 'ver32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1621' => {
                                      'BaseType' => '439',
                                      'Name' => 'ver32_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1668' => {
                                      'BaseType' => '147',
                                      'Name' => 'uint32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1737' => {
                                      'BaseType' => '912',
                                      'Name' => 'struct pldm_msg_hdr const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1742' => {
                                      'BaseType' => '978',
                                      'Name' => 'struct pldm_header_info*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1929' => {
                                      'BaseType' => '1273',
                                      'Name' => 'struct pldm_control*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2697' => {
                                      'BaseType' => '164',
                                      'Name' => 'size_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3157' => {
                                      'BaseType' => '1057',
                                      'Name' => 'struct pldm_header_info const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4829' => {
                                      'BaseType' => '135',
                                      'Header' => 'base.h',
                                      'Line' => '17',
                                      'Name' => 'pldm_tid_t',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '4841' => {
                                      'BaseType' => '135',
                                      'Header' => 'instance-id.h',
                                      'Line' => '13',
                                      'Name' => 'pldm_instance_id_t',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '4853' => {
                                      'Header' => 'responder.h',
                                      'Line' => '10',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'tid',
                                                           'offset' => '0',
                                                           'type' => '4829'
                                                         },
                                                  '1' => {
                                                           'name' => 'instance_id',
                                                           'offset' => '1',
                                                           'type' => '4841'
                                                         },
                                                  '2' => {
                                                           'name' => 'type',
                                                           'offset' => '2',
                                                           'type' => '135'
                                                         },
                                                  '3' => {
                                                           'name' => 'command',
                                                           'offset' => '3',
                                                           'type' => '135'
                                                         },
                                                  '4' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '4933'
                                                         }
                                                },
                                      'Name' => 'struct pldm_responder_cookie',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '4933' => {
                                      'BaseType' => '4853',
                                      'Name' => 'struct pldm_responder_cookie*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4938' => {
                                      'Header' => 'pldm.h',
                                      'Line' => '15',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'PLDM_REQUESTER_SUCCESS',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'PLDM_REQUESTER_OPEN_FAIL',
                                                           'value' => '18446744073709551615 (-1)'
                                                         },
                                                  '2' => {
                                                           'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
                                                           'value' => '18446744073709551614 (-2)'
                                                         },
                                                  '3' => {
                                                           'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
                                                           'value' => '18446744073709551613 (-3)'
                                                         },
                                                  '4' => {
                                                           'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
                                                           'value' => '18446744073709551612 (-4)'
                                                         },
                                                  '5' => {
                                                           'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
                                                           'value' => '18446744073709551611 (-5)'
                                                         },
                                                  '6' => {
                                                           'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
                                                           'value' => '18446744073709551610 (-6)'
                                                         },
                                                  '7' => {
                                                           'name' => 'PLDM_REQUESTER_SEND_FAIL',
                                                           'value' => '18446744073709551609 (-7)'
                                                         },
                                                  '8' => {
                                                           'name' => 'PLDM_REQUESTER_RECV_FAIL',
                                                           'value' => '18446744073709551608 (-8)'
                                                         },
                                                  '9' => {
                                                           'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
                                                           'value' => '18446744073709551607 (-9)'
                                                         },
                                                  '10' => {
                                                            'name' => 'PLDM_REQUESTER_SETUP_FAIL',
                                                            'value' => '18446744073709551606 (-10)'
                                                          },
                                                  '11' => {
                                                            'name' => 'PLDM_REQUESTER_INVALID_SETUP',
                                                            'value' => '18446744073709551605 (-11)'
                                                          },
                                                  '12' => {
                                                            'name' => 'PLDM_REQUESTER_POLL_FAIL',
                                                            'value' => '18446744073709551604 (-12)'
                                                          },
                                                  '13' => {
                                                            'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
                                                            'value' => '18446744073709551603 (-13)'
                                                          }
                                                },
                                      'Name' => 'enum pldm_requester_error_codes',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '5459' => {
                                      'Name' => '_Bool',
                                      'Size' => '1',
                                      'Type' => 'Intrinsic'
                                    },
                          '5581' => {
                                      'BaseType' => '53',
                                      'Header' => 'types.h',
                                      'Line' => '40',
                                      'Name' => '__uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '5619' => {
                                      'BaseType' => '119',
                                      'Header' => 'types.h',
                                      'Line' => '194',
                                      'Name' => '__ssize_t',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '5631' => {
                                      'BaseType' => '128',
                                      'Name' => 'char*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5655' => {
                                      'BaseType' => '135',
                                      'Name' => 'uint8_t const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '5660' => {
                                      'BaseType' => '5581',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '5856' => {
                                      'BaseType' => '5619',
                                      'Header' => 'types.h',
                                      'Line' => '108',
                                      'Name' => 'ssize_t',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '5868' => {
                                      'BaseType' => '5655',
                                      'Name' => 'uint8_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7302' => {
                                      'BaseType' => '128',
                                      'Name' => 'char const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '8652' => {
                                      'BaseType' => '7302',
                                      'Name' => 'char const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '11406' => {
                                       'BaseType' => '344',
                                       'Name' => 'bitfield8_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13168' => {
                                       'BaseType' => '801',
                                       'Name' => 'struct pldm_msg_hdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '15038' => {
                                       'Header' => 'utils.h',
                                       'Line' => '20',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ptr',
                                                            'offset' => '0',
                                                            'type' => '5868'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '164'
                                                          }
                                                 },
                                       'Name' => 'struct variable_field',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '15434' => {
                                       'BaseType' => '15038',
                                       'Name' => 'struct variable_field*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17516' => {
                                       'BaseType' => '5660',
                                       'Name' => 'uint16_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20755' => {
                                       'BaseType' => '67',
                                       'Header' => 'types.h',
                                       'Line' => '45',
                                       'Name' => '__uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '20832' => {
                                       'BaseType' => '5660',
                                       'Name' => 'uint16_t const',
                                       'Size' => '2',
                                       'Type' => 'Const'
                                     },
                          '20849' => {
                                       'BaseType' => '20755',
                                       'Header' => 'stdint-uintn.h',
                                       'Line' => '27',
                                       'Name' => 'uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '21007' => {
                                       'Header' => 'bios.h',
                                       'Line' => '39',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_BIOS_STRING_TABLE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_BIOS_ATTR_TABLE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_bios_table_types',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '21041' => {
                                       'Header' => 'bios.h',
                                       'Line' => '48',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'string_handle',
                                                            'offset' => '0',
                                                            'type' => '5660'
                                                          },
                                                   '1' => {
                                                            'name' => 'string_length',
                                                            'offset' => '2',
                                                            'type' => '5660'
                                                          },
                                                   '2' => {
                                                            'name' => 'name',
                                                            'offset' => '4',
                                                            'type' => '21098'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_string_table_entry',
                                       'Size' => '5',
                                       'Type' => 'Struct'
                                     },
                          '21093' => {
                                       'BaseType' => '21041',
                                       'Name' => 'struct pldm_bios_string_table_entry const',
                                       'Size' => '5',
                                       'Type' => 'Const'
                                     },
                          '21098' => {
                                       'BaseType' => '128',
                                       'Name' => 'char[1]',
                                       'Size' => '1',
                                       'Type' => 'Array'
                                     },
                          '21114' => {
                                       'Header' => 'bios.h',
                                       'Line' => '54',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_handle',
                                                            'offset' => '0',
                                                            'type' => '5660'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_type',
                                                            'offset' => '2',
                                                            'type' => '135'
                                                          },
                                                   '2' => {
                                                            'name' => 'string_handle',
                                                            'offset' => '3',
                                                            'type' => '5660'
                                                          },
                                                   '3' => {
                                                            'name' => 'metadata',
                                                            'offset' => '5',
                                                            'type' => '962'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_attr_table_entry',
                                       'Size' => '6',
                                       'Type' => 'Struct'
                                     },
                          '21179' => {
                                       'BaseType' => '21114',
                                       'Name' => 'struct pldm_bios_attr_table_entry const',
                                       'Size' => '6',
                                       'Type' => 'Const'
                                     },
                          '21184' => {
                                       'Header' => 'bios.h',
                                       'Line' => '66',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_handle',
                                                            'offset' => '0',
                                                            'type' => '5660'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_type',
                                                            'offset' => '2',
                                                            'type' => '135'
                                                          },
                                                   '2' => {
                                                            'name' => 'value',
                                                            'offset' => '3',
                                                            'type' => '962'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_attr_val_table_entry',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '21236' => {
                                       'BaseType' => '21184',
                                       'Name' => 'struct pldm_bios_attr_val_table_entry const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '21305' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '206',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5660'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '5459'
                                                          },
                                                   '2' => {
                                                            'name' => 'pv_num',
                                                            'offset' => '3',
                                                            'type' => '135'
                                                          },
                                                   '3' => {
                                                            'name' => 'pv_handle',
                                                            'offset' => '8',
                                                            'type' => '21408'
                                                          },
                                                   '4' => {
                                                            'name' => 'def_num',
                                                            'offset' => '22',
                                                            'type' => '135'
                                                          },
                                                   '5' => {
                                                            'name' => 'def_index',
                                                            'offset' => '36',
                                                            'type' => '5868'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '21396' => {
                                       'BaseType' => '21305',
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '21408' => {
                                       'BaseType' => '20832',
                                       'Name' => 'uint16_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '21418' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '294',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5660'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '5459'
                                                          },
                                                   '2' => {
                                                            'name' => 'string_type',
                                                            'offset' => '3',
                                                            'type' => '135'
                                                          },
                                                   '3' => {
                                                            'name' => 'min_length',
                                                            'offset' => '4',
                                                            'type' => '5660'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_length',
                                                            'offset' => '6',
                                                            'type' => '5660'
                                                          },
                                                   '5' => {
                                                            'name' => 'def_length',
                                                            'offset' => '8',
                                                            'type' => '5660'
                                                          },
                                                   '6' => {
                                                            'name' => 'def_string',
                                                            'offset' => '22',
                                                            'type' => '8652'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '21530' => {
                                       'BaseType' => '21418',
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '21540' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '384',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5660'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '5459'
                                                          },
                                                   '2' => {
                                                            'name' => 'lower_bound',
                                                            'offset' => '8',
                                                            'type' => '20849'
                                                          },
                                                   '3' => {
                                                            'name' => 'upper_bound',
                                                            'offset' => '22',
                                                            'type' => '20849'
                                                          },
                                                   '4' => {
                                                            'name' => 'scalar_increment',
                                                            'offset' => '36',
                                                            'type' => '147'
                                                          },
                                                   '5' => {
                                                            'name' => 'default_value',
                                                            'offset' => '50',
                                                            'type' => '20849'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '21638' => {
                                       'BaseType' => '21540',
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
                                       'Size' => '40',
                                       'Type' => 'Const'
                                     },
                          '21921' => {
                                       'Name' => 'ssize_t(*)(void const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '1262'
                                                           }
                                                  },
                                       'Return' => '5856',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '21991' => {
                                       'Line' => '957',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'table_data',
                                                            'offset' => '0',
                                                            'type' => '5868'
                                                          },
                                                   '1' => {
                                                            'name' => 'table_len',
                                                            'offset' => '8',
                                                            'type' => '164'
                                                          },
                                                   '2' => {
                                                            'name' => 'current_pos',
                                                            'offset' => '22',
                                                            'type' => '164'
                                                          },
                                                   '3' => {
                                                            'name' => 'entry_length_handler',
                                                            'offset' => '36',
                                                            'type' => '21921'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_iter',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Source' => 'bios_table.c',
                                       'Type' => 'Struct'
                                     },
                          '22061' => {
                                       'BaseType' => '21991',
                                       'Name' => 'struct pldm_bios_table_iter const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '23131' => {
                                       'BaseType' => '21991',
                                       'Name' => 'struct pldm_bios_table_iter*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23136' => {
                                       'BaseType' => '21236',
                                       'Name' => 'struct pldm_bios_attr_val_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23550' => {
                                       'BaseType' => '21179',
                                       'Name' => 'struct pldm_bios_attr_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '24153' => {
                                       'BaseType' => '21093',
                                       'Name' => 'struct pldm_bios_string_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '25316' => {
                                       'BaseType' => '22061',
                                       'Name' => 'struct pldm_bios_table_iter const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '29499' => {
                                       'BaseType' => '20849',
                                       'Name' => 'uint64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '29776' => {
                                       'BaseType' => '21638',
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '30085' => {
                                       'BaseType' => '8652',
                                       'Name' => 'char const**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '31214' => {
                                       'BaseType' => '21530',
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '32668' => {
                                       'BaseType' => '21396',
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '34885' => {
                                       'BaseType' => '135',
                                       'Header' => 'pldm_types.h',
                                       'Line' => '32',
                                       'Name' => 'bool8_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '34897' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '36',
                                       'Name' => 'anon-struct-pldm_types.h-36',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '35161' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '54',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '5660'
                                                          },
                                                   '1' => {
                                                            'name' => 'bits',
                                                            'offset' => '0',
                                                            'type' => '34897'
                                                          }
                                                 },
                                       'Name' => 'union bitfield16_t',
                                       'Size' => '2',
                                       'Type' => 'Union'
                                     },
                          '35173' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '58',
                                       'Name' => 'anon-struct-pldm_types.h-58',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '35661' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '92',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '147'
                                                          },
                                                   '1' => {
                                                            'name' => 'bits',
                                                            'offset' => '0',
                                                            'type' => '35173'
                                                          }
                                                 },
                                       'Name' => 'union bitfield32_t',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '35673' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '96',
                                       'Name' => 'anon-struct-pldm_types.h-96',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '36609' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '162',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '20849'
                                                          },
                                                   '1' => {
                                                            'name' => 'bits',
                                                            'offset' => '0',
                                                            'type' => '35673'
                                                          }
                                                 },
                                       'Name' => 'union bitfield64_t',
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '36668' => {
                                       'BaseType' => '164',
                                       'Name' => 'size_t const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '37302' => {
                                       'BaseType' => '15038',
                                       'Name' => 'struct variable_field const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '37560' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '157',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_STR_TYPE_UNKNOWN',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_STR_TYPE_ASCII',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_STR_TYPE_UTF_8',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'PLDM_STR_TYPE_UTF_16',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'PLDM_STR_TYPE_UTF_16LE',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'PLDM_STR_TYPE_UTF_16BE',
                                                            'value' => '5'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_firmware_update_string_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '37893' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '256',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_CRC_COMP_CAN_BE_UPDATED',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_CRC_COMP_COMPARISON_STAMP_IDENTICAL',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_CRC_COMP_COMPARISON_STAMP_LOWER',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'PLDM_CRC_INVALID_COMP_COMPARISON_STAMP',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'PLDM_CRC_COMP_CONFLICT',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'PLDM_CRC_COMP_PREREQUISITES_NOT_MET',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'PLDM_CRC_COMP_NOT_SUPPORTED',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'PLDM_CRC_COMP_SECURITY_RESTRICTIONS',
                                                            'value' => '7'
                                                          },
                                                   '8' => {
                                                            'name' => 'PLDM_CRC_INCOMPLETE_COMP_IMAGE_SET',
                                                            'value' => '8'
                                                          },
                                                   '9' => {
                                                            'name' => 'PLDM_CRC_ACTIVE_IMAGE_NOT_UPDATEABLE_SUBSEQUENTLY',
                                                            'value' => '9'
                                                          },
                                                   '10' => {
                                                             'name' => 'PLDM_CRC_COMP_VER_STR_IDENTICAL',
                                                             'value' => '10'
                                                           },
                                                   '11' => {
                                                             'name' => 'PLDM_CRC_COMP_VER_STR_LOWER',
                                                             'value' => '11'
                                                           },
                                                   '12' => {
                                                             'name' => 'PLDM_CRC_VENDOR_COMP_RESP_CODE_RANGE_MIN',
                                                             'value' => '208'
                                                           },
                                                   '13' => {
                                                             'name' => 'PLDM_CRC_VENDOR_COMP_RESP_CODE_RANGE_MAX',
                                                             'value' => '239'
                                                           }
                                                 },
                                       'Name' => 'enum pldm_component_response_codes',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '38195' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '355',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_FD_STATE_IDLE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_FD_STATE_LEARN_COMPONENTS',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_FD_STATE_READY_XFER',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'PLDM_FD_STATE_DOWNLOAD',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'PLDM_FD_STATE_VERIFY',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'PLDM_FD_STATE_APPLY',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'PLDM_FD_STATE_ACTIVATE',
                                                            'value' => '6'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_firmware_device_states',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '38339' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '386',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_FD_INITIALIZATION',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_FD_ACTIVATE_FW',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_FD_CANCEL_UPDATE',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'PLDM_FD_TIMEOUT_LEARN_COMPONENT',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'PLDM_FD_TIMEOUT_READY_XFER',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'PLDM_FD_TIMEOUT_DOWNLOAD',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'PLDM_FD_TIMEOUT_VERIFY',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'PLDM_FD_TIMEOUT_APPLY',
                                                            'value' => '7'
                                                          },
                                                   '8' => {
                                                            'name' => 'PLDM_FD_STATUS_VENDOR_DEFINED_MIN',
                                                            'value' => '200'
                                                          },
                                                   '9' => {
                                                            'name' => 'PLDM_FD_STATUS_VENDOR_DEFINED_MAX',
                                                            'value' => '255'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_get_status_reason_code_values',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '38471' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '421',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'str_type',
                                                            'offset' => '0',
                                                            'type' => '37560'
                                                          },
                                                   '1' => {
                                                            'name' => 'str_len',
                                                            'offset' => '4',
                                                            'type' => '135'
                                                          },
                                                   '2' => {
                                                            'name' => 'str_data',
                                                            'offset' => '5',
                                                            'type' => '38523'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_firmware_string',
                                       'Size' => '72',
                                       'Type' => 'Struct'
                                     },
                          '38523' => {
                                       'BaseType' => '135',
                                       'Name' => 'uint8_t[64]',
                                       'Size' => '64',
                                       'Type' => 'Array'
                                     },
                          '38539' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '431',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comparison_stamp',
                                                            'offset' => '0',
                                                            'type' => '147'
                                                          },
                                                   '1' => {
                                                            'name' => 'str',
                                                            'offset' => '4',
                                                            'type' => '38471'
                                                          },
                                                   '2' => {
                                                            'name' => 'date',
                                                            'offset' => '118',
                                                            'type' => '38592'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_firmware_version',
                                       'Size' => '84',
                                       'Type' => 'Struct'
                                     },
                          '38592' => {
                                       'BaseType' => '135',
                                       'Name' => 'uint8_t[8]',
                                       'Size' => '8',
                                       'Type' => 'Array'
                                     },
                          '38608' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '441',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'uuid',
                                                            'offset' => '0',
                                                            'type' => '38712'
                                                          },
                                                   '1' => {
                                                            'name' => 'package_header_format_version',
                                                            'offset' => '22',
                                                            'type' => '135'
                                                          },
                                                   '2' => {
                                                            'name' => 'package_header_size',
                                                            'offset' => '23',
                                                            'type' => '5660'
                                                          },
                                                   '3' => {
                                                            'name' => 'package_release_date_time',
                                                            'offset' => '25',
                                                            'type' => '38728'
                                                          },
                                                   '4' => {
                                                            'name' => 'component_bitmap_bit_length',
                                                            'offset' => '50',
                                                            'type' => '5660'
                                                          },
                                                   '5' => {
                                                            'name' => 'package_version_string_type',
                                                            'offset' => '52',
                                                            'type' => '135'
                                                          },
                                                   '6' => {
                                                            'name' => 'package_version_string_length',
                                                            'offset' => '53',
                                                            'type' => '135'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_header_information',
                                       'Size' => '36',
                                       'Type' => 'Struct'
                                     },
                          '38712' => {
                                       'BaseType' => '135',
                                       'Name' => 'uint8_t[16]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '38728' => {
                                       'BaseType' => '135',
                                       'Name' => 'uint8_t[13]',
                                       'Size' => '13',
                                       'Type' => 'Array'
                                     },
                          '38744' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '455',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_length',
                                                            'offset' => '0',
                                                            'type' => '5660'
                                                          },
                                                   '1' => {
                                                            'name' => 'descriptor_count',
                                                            'offset' => '2',
                                                            'type' => '135'
                                                          },
                                                   '2' => {
                                                            'name' => 'device_update_option_flags',
                                                            'offset' => '3',
                                                            'type' => '35661'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_image_set_version_string_type',
                                                            'offset' => '7',
                                                            'type' => '135'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_image_set_version_string_length',
                                                            'offset' => '8',
                                                            'type' => '135'
                                                          },
                                                   '5' => {
                                                            'name' => 'fw_device_pkg_data_length',
                                                            'offset' => '9',
                                                            'type' => '5660'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_firmware_device_id_record',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '38939' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '489',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '5660'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '5660'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_comparison_stamp',
                                                            'offset' => '4',
                                                            'type' => '147'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_options',
                                                            'offset' => '8',
                                                            'type' => '35161'
                                                          },
                                                   '4' => {
                                                            'name' => 'requested_comp_activation_method',
                                                            'offset' => '16',
                                                            'type' => '35161'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_location_offset',
                                                            'offset' => '18',
                                                            'type' => '147'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_size',
                                                            'offset' => '22',
                                                            'type' => '147'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_version_string_type',
                                                            'offset' => '32',
                                                            'type' => '135'
                                                          },
                                                   '8' => {
                                                            'name' => 'comp_version_string_length',
                                                            'offset' => '33',
                                                            'type' => '135'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_component_image_information',
                                       'Size' => '22',
                                       'Type' => 'Struct'
                                     },
                          '39121' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '515',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '135'
                                                          },
                                                   '1' => {
                                                            'name' => 'capabilities_during_update',
                                                            'offset' => '1',
                                                            'type' => '35661'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_count',
                                                            'offset' => '5',
                                                            'type' => '5660'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_image_set_ver_str_type',
                                                            'offset' => '7',
                                                            'type' => '135'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_image_set_ver_str_len',
                                                            'offset' => '8',
                                                            'type' => '135'
                                                          },
                                                   '5' => {
                                                            'name' => 'pending_comp_image_set_ver_str_type',
                                                            'offset' => '9',
                                                            'type' => '135'
                                                          },
                                                   '6' => {
                                                            'name' => 'pending_comp_image_set_ver_str_len',
                                                            'offset' => '16',
                                                            'type' => '135'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_get_firmware_parameters_resp',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '39225' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '529',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '135'
                                                          },
                                                   '1' => {
                                                            'name' => 'capabilities_during_update',
                                                            'offset' => '4',
                                                            'type' => '35661'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_count',
                                                            'offset' => '8',
                                                            'type' => '5660'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_image_set_ver_str',
                                                            'offset' => '18',
                                                            'type' => '38471'
                                                          },
                                                   '4' => {
                                                            'name' => 'pending_comp_image_set_ver_str',
                                                            'offset' => '132',
                                                            'type' => '38471'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_get_firmware_parameters_resp_full',
                                       'Size' => '156',
                                       'Type' => 'Struct'
                                     },
                          '39303' => {
                                       'BaseType' => '39225',
                                       'Name' => 'struct pldm_get_firmware_parameters_resp_full const',
                                       'Size' => '156',
                                       'Type' => 'Const'
                                     },
                          '39308' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '543',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '135'
                                                          },
                                                   '1' => {
                                                            'name' => 'downstream_device_update_supported',
                                                            'offset' => '1',
                                                            'type' => '135'
                                                          },
                                                   '2' => {
                                                            'name' => 'number_of_downstream_devices',
                                                            'offset' => '2',
                                                            'type' => '5660'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_number_of_downstream_devices',
                                                            'offset' => '4',
                                                            'type' => '5660'
                                                          },
                                                   '4' => {
                                                            'name' => 'capabilities',
                                                            'offset' => '8',
                                                            'type' => '35661'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_query_downstream_devices_resp',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '39386' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '555',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '5660'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '5660'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_classification_index',
                                                            'offset' => '4',
                                                            'type' => '135'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_comparison_stamp',
                                                            'offset' => '5',
                                                            'type' => '147'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_ver_str_type',
                                                            'offset' => '9',
                                                            'type' => '135'
                                                          },
                                                   '5' => {
                                                            'name' => 'active_comp_ver_str_len',
                                                            'offset' => '16',
                                                            'type' => '135'
                                                          },
                                                   '6' => {
                                                            'name' => 'active_comp_release_date',
                                                            'offset' => '17',
                                                            'type' => '38592'
                                                          },
                                                   '7' => {
                                                            'name' => 'pending_comp_comparison_stamp',
                                                            'offset' => '25',
                                                            'type' => '147'
                                                          },
                                                   '8' => {
                                                            'name' => 'pending_comp_ver_str_type',
                                                            'offset' => '35',
                                                            'type' => '135'
                                                          },
                                                   '9' => {
                                                            'name' => 'pending_comp_ver_str_len',
                                                            'offset' => '36',
                                                            'type' => '135'
                                                          },
                                                   '10' => {
                                                             'name' => 'pending_comp_release_date',
                                                             'offset' => '37',
                                                             'type' => '38592'
                                                           },
                                                   '11' => {
                                                             'name' => 'comp_activation_methods',
                                                             'offset' => '51',
                                                             'type' => '35161'
                                                           },
                                                   '12' => {
                                                             'name' => 'capabilities_during_update',
                                                             'offset' => '53',
                                                             'type' => '35661'
                                                           }
                                                 },
                                       'Name' => 'struct pldm_component_parameter_entry',
                                       'Size' => '39',
                                       'Type' => 'Struct'
                                     },
                          '39568' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '577',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '5660'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '5660'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_classification_index',
                                                            'offset' => '4',
                                                            'type' => '135'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_ver',
                                                            'offset' => '8',
                                                            'type' => '38539'
                                                          },
                                                   '4' => {
                                                            'name' => 'pending_ver',
                                                            'offset' => '146',
                                                            'type' => '38539'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_activation_methods',
                                                            'offset' => '374',
                                                            'type' => '35161'
                                                          },
                                                   '6' => {
                                                            'name' => 'capabilities_during_update',
                                                            'offset' => '384',
                                                            'type' => '35661'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_component_parameter_entry_full',
                                       'Size' => '184',
                                       'Type' => 'Struct'
                                     },
                          '39672' => {
                                       'BaseType' => '39568',
                                       'Name' => 'struct pldm_component_parameter_entry_full const',
                                       'Size' => '184',
                                       'Type' => 'Const'
                                     },
                          '39677' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '594',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'data_transfer_handle',
                                                            'offset' => '0',
                                                            'type' => '147'
                                                          },
                                                   '1' => {
                                                            'name' => 'transfer_operation_flag',
                                                            'offset' => '4',
                                                            'type' => '135'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_query_downstream_identifiers_req',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '39716' => {
                                       'BaseType' => '39677',
                                       'Name' => 'struct pldm_query_downstream_identifiers_req const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '39721' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '608',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '135'
                                                          },
                                                   '1' => {
                                                            'name' => 'next_data_transfer_handle',
                                                            'offset' => '4',
                                                            'type' => '147'
                                                          },
                                                   '2' => {
                                                            'name' => 'transfer_flag',
                                                            'offset' => '8',
                                                            'type' => '135'
                                                          },
                                                   '3' => {
                                                            'name' => 'downstream_devices_length',
                                                            'offset' => '18',
                                                            'type' => '147'
                                                          },
                                                   '4' => {
                                                            'name' => 'number_of_downstream_devices',
                                                            'offset' => '22',
                                                            'type' => '5660'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_query_downstream_identifiers_resp',
                                       'Size' => '20',
                                       'Type' => 'Struct'
                                     },
                          '39799' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '621',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'downstream_device_index',
                                                            'offset' => '0',
                                                            'type' => '5660'
                                                          },
                                                   '1' => {
                                                            'name' => 'downstream_descriptor_count',
                                                            'offset' => '2',
                                                            'type' => '135'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_downstream_device',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '39838' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '627',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'field',
                                                            'offset' => '0',
                                                            'type' => '15038'
                                                          },
                                                   '1' => {
                                                            'name' => 'devs',
                                                            'offset' => '22',
                                                            'type' => '164'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_downstream_device_iter',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '39877' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '701',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'descriptor_type',
                                                            'offset' => '0',
                                                            'type' => '5660'
                                                          },
                                                   '1' => {
                                                            'name' => 'descriptor_length',
                                                            'offset' => '2',
                                                            'type' => '5660'
                                                          },
                                                   '2' => {
                                                            'name' => 'descriptor_data',
                                                            'offset' => '8',
                                                            'type' => '1262'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_descriptor',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '39929' => {
                                       'BaseType' => '39877',
                                       'Name' => 'struct pldm_descriptor const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '39945' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '707',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'field',
                                                            'offset' => '0',
                                                            'type' => '15434'
                                                          },
                                                   '1' => {
                                                            'name' => 'count',
                                                            'offset' => '8',
                                                            'type' => '164'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_descriptor_iter',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '39989' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '800',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'data_transfer_handle',
                                                            'offset' => '0',
                                                            'type' => '147'
                                                          },
                                                   '1' => {
                                                            'name' => 'transfer_operation_flag',
                                                            'offset' => '4',
                                                            'type' => '135'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_get_downstream_firmware_parameters_req',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '40028' => {
                                       'BaseType' => '39989',
                                       'Name' => 'struct pldm_get_downstream_firmware_parameters_req const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '40033' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '815',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '135'
                                                          },
                                                   '1' => {
                                                            'name' => 'next_data_transfer_handle',
                                                            'offset' => '4',
                                                            'type' => '147'
                                                          },
                                                   '2' => {
                                                            'name' => 'transfer_flag',
                                                            'offset' => '8',
                                                            'type' => '135'
                                                          },
                                                   '3' => {
                                                            'name' => 'fdp_capabilities_during_update',
                                                            'offset' => '18',
                                                            'type' => '35661'
                                                          },
                                                   '4' => {
                                                            'name' => 'downstream_device_count',
                                                            'offset' => '22',
                                                            'type' => '5660'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_get_downstream_firmware_parameters_resp',
                                       'Size' => '20',
                                       'Type' => 'Struct'
                                     },
                          '40111' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '833',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'downstream_device_index',
                                                            'offset' => '0',
                                                            'type' => '5660'
                                                          },
                                                   '1' => {
                                                            'name' => 'active_comp_comparison_stamp',
                                                            'offset' => '4',
                                                            'type' => '147'
                                                          },
                                                   '2' => {
                                                            'name' => 'active_comp_ver_str_type',
                                                            'offset' => '8',
                                                            'type' => '135'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_ver_str_len',
                                                            'offset' => '9',
                                                            'type' => '135'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_release_date',
                                                            'offset' => '16',
                                                            'type' => '40293'
                                                          },
                                                   '5' => {
                                                            'name' => 'pending_comp_comparison_stamp',
                                                            'offset' => '32',
                                                            'type' => '147'
                                                          },
                                                   '6' => {
                                                            'name' => 'pending_comp_ver_str_type',
                                                            'offset' => '36',
                                                            'type' => '135'
                                                          },
                                                   '7' => {
                                                            'name' => 'pending_comp_ver_str_len',
                                                            'offset' => '37',
                                                            'type' => '135'
                                                          },
                                                   '8' => {
                                                            'name' => 'pending_comp_release_date',
                                                            'offset' => '38',
                                                            'type' => '40293'
                                                          },
                                                   '9' => {
                                                            'name' => 'comp_activation_methods',
                                                            'offset' => '54',
                                                            'type' => '35161'
                                                          },
                                                   '10' => {
                                                             'name' => 'capabilities_during_update',
                                                             'offset' => '64',
                                                             'type' => '35661'
                                                           },
                                                   '11' => {
                                                             'name' => 'active_comp_ver_str',
                                                             'offset' => '72',
                                                             'type' => '1262'
                                                           },
                                                   '12' => {
                                                             'name' => 'pending_comp_ver_str',
                                                             'offset' => '86',
                                                             'type' => '1262'
                                                           }
                                                 },
                                       'Name' => 'struct pldm_downstream_device_parameters_entry',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '40293' => {
                                       'BaseType' => '128',
                                       'Name' => 'char[9]',
                                       'Size' => '9',
                                       'Type' => 'Array'
                                     },
                          '40400' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '873',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_transfer_size',
                                                            'offset' => '0',
                                                            'type' => '147'
                                                          },
                                                   '1' => {
                                                            'name' => 'num_of_comp',
                                                            'offset' => '4',
                                                            'type' => '5660'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_outstanding_transfer_req',
                                                            'offset' => '6',
                                                            'type' => '135'
                                                          },
                                                   '3' => {
                                                            'name' => 'pkg_data_len',
                                                            'offset' => '8',
                                                            'type' => '5660'
                                                          },
                                                   '4' => {
                                                            'name' => 'image_set_ver',
                                                            'offset' => '18',
                                                            'type' => '38471'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_request_update_req_full',
                                       'Size' => '84',
                                       'Type' => 'Struct'
                                     },
                          '40478' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '886',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '135'
                                                          },
                                                   '1' => {
                                                            'name' => 'fd_meta_data_len',
                                                            'offset' => '1',
                                                            'type' => '5660'
                                                          },
                                                   '2' => {
                                                            'name' => 'fd_will_send_pkg_data',
                                                            'offset' => '3',
                                                            'type' => '135'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_request_update_resp',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '40530' => {
                                       'BaseType' => '40478',
                                       'Name' => 'struct pldm_request_update_resp const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '40639' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '913',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'transfer_flag',
                                                            'offset' => '0',
                                                            'type' => '135'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '2',
                                                            'type' => '5660'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '4',
                                                            'type' => '5660'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_classification_index',
                                                            'offset' => '6',
                                                            'type' => '135'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_comparison_stamp',
                                                            'offset' => '8',
                                                            'type' => '147'
                                                          },
                                                   '5' => {
                                                            'name' => 'version',
                                                            'offset' => '18',
                                                            'type' => '38471'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pass_component_table_req_full',
                                       'Size' => '84',
                                       'Type' => 'Struct'
                                     },
                          '40730' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '926',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '135'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_resp',
                                                            'offset' => '1',
                                                            'type' => '135'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_resp_code',
                                                            'offset' => '2',
                                                            'type' => '135'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pass_component_table_resp',
                                       'Size' => '3',
                                       'Type' => 'Struct'
                                     },
                          '40782' => {
                                       'BaseType' => '40730',
                                       'Name' => 'struct pldm_pass_component_table_resp const',
                                       'Size' => '3',
                                       'Type' => 'Const'
                                     },
                          '40904' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '954',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '5660'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '5660'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_classification_index',
                                                            'offset' => '4',
                                                            'type' => '135'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_comparison_stamp',
                                                            'offset' => '8',
                                                            'type' => '147'
                                                          },
                                                   '4' => {
                                                            'name' => 'version',
                                                            'offset' => '18',
                                                            'type' => '38471'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_image_size',
                                                            'offset' => '132',
                                                            'type' => '147'
                                                          },
                                                   '6' => {
                                                            'name' => 'update_option_flags',
                                                            'offset' => '136',
                                                            'type' => '35661'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_update_component_req_full',
                                       'Size' => '92',
                                       'Type' => 'Struct'
                                     },
                          '41008' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '970',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '135'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_compatibility_resp',
                                                            'offset' => '1',
                                                            'type' => '135'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_compatibility_resp_code',
                                                            'offset' => '2',
                                                            'type' => '135'
                                                          },
                                                   '3' => {
                                                            'name' => 'update_option_flags_enabled',
                                                            'offset' => '3',
                                                            'type' => '35661'
                                                          },
                                                   '4' => {
                                                            'name' => 'time_before_req_fw_data',
                                                            'offset' => '7',
                                                            'type' => '5660'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_update_component_resp',
                                       'Size' => '9',
                                       'Type' => 'Struct'
                                     },
                          '41086' => {
                                       'BaseType' => '41008',
                                       'Name' => 'struct pldm_update_component_resp const',
                                       'Size' => '9',
                                       'Type' => 'Const'
                                     },
                          '41091' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '982',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'offset',
                                                            'offset' => '0',
                                                            'type' => '147'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '4',
                                                            'type' => '147'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_request_firmware_data_req',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '41130' => {
                                       'BaseType' => '41091',
                                       'Name' => 'struct pldm_request_firmware_data_req const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '41135' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '991',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'apply_result',
                                                            'offset' => '0',
                                                            'type' => '135'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_activation_methods_modification',
                                                            'offset' => '1',
                                                            'type' => '35161'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_apply_complete_req',
                                       'Size' => '3',
                                       'Type' => 'Struct'
                                     },
                          '41174' => {
                                       'BaseType' => '41135',
                                       'Name' => 'struct pldm_apply_complete_req const',
                                       'Size' => '3',
                                       'Type' => 'Const'
                                     },
                          '41205' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '1008',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '135'
                                                          },
                                                   '1' => {
                                                            'name' => 'estimated_time_activation',
                                                            'offset' => '1',
                                                            'type' => '5660'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_activate_firmware_resp',
                                       'Size' => '3',
                                       'Type' => 'Struct'
                                     },
                          '41244' => {
                                       'BaseType' => '41205',
                                       'Name' => 'struct pldm_activate_firmware_resp const',
                                       'Size' => '3',
                                       'Type' => 'Const'
                                     },
                          '41249' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '1017',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '135'
                                                          },
                                                   '1' => {
                                                            'name' => 'current_state',
                                                            'offset' => '1',
                                                            'type' => '135'
                                                          },
                                                   '2' => {
                                                            'name' => 'previous_state',
                                                            'offset' => '2',
                                                            'type' => '135'
                                                          },
                                                   '3' => {
                                                            'name' => 'aux_state',
                                                            'offset' => '3',
                                                            'type' => '135'
                                                          },
                                                   '4' => {
                                                            'name' => 'aux_state_status',
                                                            'offset' => '4',
                                                            'type' => '135'
                                                          },
                                                   '5' => {
                                                            'name' => 'progress_percent',
                                                            'offset' => '5',
                                                            'type' => '135'
                                                          },
                                                   '6' => {
                                                            'name' => 'reason_code',
                                                            'offset' => '6',
                                                            'type' => '135'
                                                          },
                                                   '7' => {
                                                            'name' => 'update_option_flags_enabled',
                                                            'offset' => '7',
                                                            'type' => '35661'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_get_status_resp',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '41366' => {
                                       'BaseType' => '41249',
                                       'Name' => 'struct pldm_get_status_resp const',
                                       'Size' => '11',
                                       'Type' => 'Const'
                                     },
                          '41371' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '1032',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '135'
                                                          },
                                                   '1' => {
                                                            'name' => 'non_functioning_component_indication',
                                                            'offset' => '1',
                                                            'type' => '34885'
                                                          },
                                                   '2' => {
                                                            'name' => 'non_functioning_component_bitmap',
                                                            'offset' => '2',
                                                            'type' => '20849'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_cancel_update_resp',
                                       'Size' => '10',
                                       'Type' => 'Struct'
                                     },
                          '41423' => {
                                       'BaseType' => '41371',
                                       'Name' => 'struct pldm_cancel_update_resp const',
                                       'Size' => '10',
                                       'Type' => 'Const'
                                     },
                          '41428' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '1347',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'field',
                                                            'offset' => '0',
                                                            'type' => '15038'
                                                          },
                                                   '1' => {
                                                            'name' => 'entries',
                                                            'offset' => '22',
                                                            'type' => '164'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_downstream_device_parameters_iter',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '42526' => {
                                       'BaseType' => '41423',
                                       'Name' => 'struct pldm_cancel_update_resp const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '42723' => {
                                       'BaseType' => '34885',
                                       'Name' => 'bool8_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '42728' => {
                                       'BaseType' => '36609',
                                       'Name' => 'bitfield64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '44640' => {
                                       'BaseType' => '41366',
                                       'Name' => 'struct pldm_get_status_resp const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '44972' => {
                                       'BaseType' => '35661',
                                       'Name' => 'bitfield32_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '45869' => {
                                       'BaseType' => '41244',
                                       'Name' => 'struct pldm_activate_firmware_resp const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '46607' => {
                                       'BaseType' => '5459',
                                       'Name' => '_Bool*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '47518' => {
                                       'BaseType' => '41174',
                                       'Name' => 'struct pldm_apply_complete_req const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '47633' => {
                                       'BaseType' => '35161',
                                       'Name' => 'bitfield16_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '50259' => {
                                       'BaseType' => '41130',
                                       'Name' => 'struct pldm_request_firmware_data_req const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51498' => {
                                       'BaseType' => '41086',
                                       'Name' => 'struct pldm_update_component_resp const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '53751' => {
                                       'BaseType' => '40904',
                                       'Name' => 'struct pldm_update_component_req_full*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '54224' => {
                                       'BaseType' => '37302',
                                       'Name' => 'struct variable_field const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '55064' => {
                                       'BaseType' => '40782',
                                       'Name' => 'struct pldm_pass_component_table_resp const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '57063' => {
                                       'BaseType' => '40639',
                                       'Name' => 'struct pldm_pass_component_table_req_full*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '58392' => {
                                       'BaseType' => '40530',
                                       'Name' => 'struct pldm_request_update_resp const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '60205' => {
                                       'BaseType' => '40400',
                                       'Name' => 'struct pldm_request_update_req_full*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '63219' => {
                                       'BaseType' => '41428',
                                       'Name' => 'struct pldm_downstream_device_parameters_iter*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '63224' => {
                                       'BaseType' => '40111',
                                       'Name' => 'struct pldm_downstream_device_parameters_entry*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '64584' => {
                                       'BaseType' => '40033',
                                       'Name' => 'struct pldm_get_downstream_firmware_parameters_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '65274' => {
                                       'BaseType' => '40028',
                                       'Name' => 'struct pldm_get_downstream_firmware_parameters_req const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '66032' => {
                                       'BaseType' => '39838',
                                       'Name' => 'struct pldm_downstream_device_iter*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '66037' => {
                                       'BaseType' => '39799',
                                       'Name' => 'struct pldm_downstream_device*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '67412' => {
                                       'BaseType' => '39721',
                                       'Name' => 'struct pldm_query_downstream_identifiers_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '68102' => {
                                       'BaseType' => '39716',
                                       'Name' => 'struct pldm_query_downstream_identifiers_req const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '69387' => {
                                       'BaseType' => '39308',
                                       'Name' => 'struct pldm_query_downstream_devices_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '69834' => {
                                       'BaseType' => '39386',
                                       'Name' => 'struct pldm_component_parameter_entry*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '72701' => {
                                       'BaseType' => '39672',
                                       'Name' => 'struct pldm_component_parameter_entry_full const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '74629' => {
                                       'BaseType' => '39303',
                                       'Name' => 'struct pldm_get_firmware_parameters_resp_full const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '74854' => {
                                       'BaseType' => '39121',
                                       'Name' => 'struct pldm_get_firmware_parameters_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '76549' => {
                                       'BaseType' => '39929',
                                       'Name' => 'struct pldm_descriptor const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '76710' => {
                                       'BaseType' => '1186',
                                       'Name' => 'uint8_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '77052' => {
                                       'BaseType' => '38939',
                                       'Name' => 'struct pldm_component_image_information*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '78904' => {
                                       'BaseType' => '39945',
                                       'Name' => 'struct pldm_descriptor_iter*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '78909' => {
                                       'BaseType' => '39877',
                                       'Name' => 'struct pldm_descriptor*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '79194' => {
                                       'BaseType' => '38744',
                                       'Name' => 'struct pldm_firmware_device_id_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '79649' => {
                                       'BaseType' => '38608',
                                       'Name' => 'struct pldm_package_header_information*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80782' => {
                                       'BaseType' => '126',
                                       'Name' => 'void**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '87969' => {
                                       'BaseType' => '74',
                                       'Header' => 'types.h',
                                       'Line' => '37',
                                       'Name' => '__int8_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '88000' => {
                                       'BaseType' => '93',
                                       'Header' => 'types.h',
                                       'Line' => '39',
                                       'Name' => '__int16_t',
                                       'PrivateABI' => 1,
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '88031' => {
                                       'BaseType' => '100',
                                       'Header' => 'types.h',
                                       'Line' => '41',
                                       'Name' => '__int32_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '88093' => {
                                       'BaseType' => '87969',
                                       'Header' => 'stdint-intn.h',
                                       'Line' => '24',
                                       'Name' => 'int8_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '88105' => {
                                       'BaseType' => '88000',
                                       'Header' => 'stdint-intn.h',
                                       'Line' => '25',
                                       'Name' => 'int16_t',
                                       'PrivateABI' => 1,
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '88117' => {
                                       'BaseType' => '88031',
                                       'Header' => 'stdint-intn.h',
                                       'Line' => '26',
                                       'Name' => 'int32_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '88358' => {
                                       'BaseType' => '444',
                                       'Header' => 'pldm_types.h',
                                       'Line' => '164',
                                       'Name' => 'real32_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '88525' => {
                                       'BaseType' => '88542',
                                       'Header' => 'pdr.h',
                                       'Line' => '16',
                                       'Name' => 'pldm_pdr',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '88537' => {
                                       'BaseType' => '88525',
                                       'Name' => 'pldm_pdr const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '88542' => {
                                       'Line' => '30',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_count',
                                                            'offset' => '0',
                                                            'type' => '147'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '4',
                                                            'type' => '147'
                                                          },
                                                   '2' => {
                                                            'name' => 'first',
                                                            'offset' => '8',
                                                            'type' => '90670'
                                                          },
                                                   '3' => {
                                                            'name' => 'last',
                                                            'offset' => '22',
                                                            'type' => '90670'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Source' => 'pdr.c',
                                       'Type' => 'Struct'
                                     },
                          '88608' => {
                                       'BaseType' => '88625',
                                       'Header' => 'pdr.h',
                                       'Line' => '21',
                                       'Name' => 'pldm_pdr_record',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '88620' => {
                                       'BaseType' => '88608',
                                       'Name' => 'pldm_pdr_record const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '88625' => {
                                       'Line' => '21',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '147'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '4',
                                                            'type' => '147'
                                                          },
                                                   '2' => {
                                                            'name' => 'data',
                                                            'offset' => '8',
                                                            'type' => '1186'
                                                          },
                                                   '3' => {
                                                            'name' => 'next',
                                                            'offset' => '22',
                                                            'type' => '90658'
                                                          },
                                                   '4' => {
                                                            'name' => 'is_remote',
                                                            'offset' => '36',
                                                            'type' => '5459'
                                                          },
                                                   '5' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '38',
                                                            'type' => '5660'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_record',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Source' => 'pdr.c',
                                       'Type' => 'Struct'
                                     },
                          '88717' => {
                                       'Header' => 'pdr.h',
                                       'Line' => '300',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '0',
                                                            'type' => '5660'
                                                          },
                                                   '1' => {
                                                            'name' => 'entity_instance_num',
                                                            'offset' => '2',
                                                            'type' => '5660'
                                                          },
                                                   '2' => {
                                                            'name' => 'entity_container_id',
                                                            'offset' => '4',
                                                            'type' => '5660'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity',
                                       'Size' => '6',
                                       'Type' => 'Struct'
                                     },
                          '88779' => {
                                       'BaseType' => '88717',
                                       'Header' => 'pdr.h',
                                       'Line' => '304',
                                       'Name' => 'pldm_entity',
                                       'Size' => '6',
                                       'Type' => 'Typedef'
                                     },
                          '88824' => {
                                       'BaseType' => '88837',
                                       'Header' => 'pdr.h',
                                       'Line' => '314',
                                       'Name' => 'pldm_entity_association_tree',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '88837' => {
                                       'Line' => '499',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'root',
                                                            'offset' => '0',
                                                            'type' => '90675'
                                                          },
                                                   '1' => {
                                                            'name' => 'last_used_container_id',
                                                            'offset' => '8',
                                                            'type' => '5660'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity_association_tree',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Source' => 'pdr.c',
                                       'Type' => 'Struct'
                                     },
                          '88880' => {
                                       'BaseType' => '88898',
                                       'Header' => 'pdr.h',
                                       'Line' => '319',
                                       'Name' => 'pldm_entity_node',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '88893' => {
                                       'BaseType' => '88880',
                                       'Name' => 'pldm_entity_node const',
                                       'Size' => '40',
                                       'Type' => 'Const'
                                     },
                          '88898' => {
                                       'Line' => '504',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity',
                                                            'offset' => '0',
                                                            'type' => '88779'
                                                          },
                                                   '1' => {
                                                            'name' => 'parent',
                                                            'offset' => '6',
                                                            'type' => '88779'
                                                          },
                                                   '2' => {
                                                            'name' => 'remote_container_id',
                                                            'offset' => '18',
                                                            'type' => '5660'
                                                          },
                                                   '3' => {
                                                            'name' => 'first_child',
                                                            'offset' => '22',
                                                            'type' => '90675'
                                                          },
                                                   '4' => {
                                                            'name' => 'next_sibling',
                                                            'offset' => '36',
                                                            'type' => '90675'
                                                          },
                                                   '5' => {
                                                            'name' => 'association_type',
                                                            'offset' => '50',
                                                            'type' => '135'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity_node',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Source' => 'pdr.c',
                                       'Type' => 'Struct'
                                     },
                          '89172' => {
                                       'Header' => 'platform.h',
                                       'Line' => '551',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '147'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '4',
                                                            'type' => '135'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '5',
                                                            'type' => '135'
                                                          },
                                                   '3' => {
                                                            'name' => 'record_change_num',
                                                            'offset' => '6',
                                                            'type' => '5660'
                                                          },
                                                   '4' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '5660'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_hdr',
                                       'Size' => '10',
                                       'Type' => 'Struct'
                                     },
                          '89623' => {
                                       'Header' => 'platform.h',
                                       'Line' => '626',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '89172'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '16',
                                                            'type' => '5660'
                                                          },
                                                   '2' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '18',
                                                            'type' => '5660'
                                                          },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '20',
                                                            'type' => '5660'
                                                          },
                                                   '4' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '22',
                                                            'type' => '5660'
                                                          },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '24',
                                                            'type' => '5660'
                                                          },
                                                   '6' => {
                                                            'name' => 'sensor_init',
                                                            'offset' => '32',
                                                            'type' => '135'
                                                          },
                                                   '7' => {
                                                            'name' => 'sensor_auxiliary_names_pdr',
                                                            'offset' => '33',
                                                            'type' => '34885'
                                                          },
                                                   '8' => {
                                                            'name' => 'composite_sensor_count',
                                                            'offset' => '34',
                                                            'type' => '135'
                                                          },
                                                   '9' => {
                                                            'name' => 'possible_states',
                                                            'offset' => '35',
                                                            'type' => '962'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_state_sensor_pdr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '89777' => {
                                       'Header' => 'platform.h',
                                       'Line' => '653',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '89172'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '16',
                                                            'type' => '5660'
                                                          },
                                                   '2' => {
                                                            'name' => 'effecter_id',
                                                            'offset' => '18',
                                                            'type' => '5660'
                                                          },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '20',
                                                            'type' => '5660'
                                                          },
                                                   '4' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '22',
                                                            'type' => '5660'
                                                          },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '24',
                                                            'type' => '5660'
                                                          },
                                                   '6' => {
                                                            'name' => 'effecter_semantic_id',
                                                            'offset' => '32',
                                                            'type' => '5660'
                                                          },
                                                   '7' => {
                                                            'name' => 'effecter_init',
                                                            'offset' => '34',
                                                            'type' => '135'
                                                          },
                                                   '8' => {
                                                            'name' => 'has_description_pdr',
                                                            'offset' => '35',
                                                            'type' => '34885'
                                                          },
                                                   '9' => {
                                                            'name' => 'composite_effecter_count',
                                                            'offset' => '36',
                                                            'type' => '135'
                                                          },
                                                   '10' => {
                                                             'name' => 'possible_states',
                                                             'offset' => '37',
                                                             'type' => '962'
                                                           }
                                                 },
                                       'Name' => 'struct pldm_state_effecter_pdr',
                                       'Size' => '26',
                                       'Type' => 'Struct'
                                     },
                          '90025' => {
                                       'Header' => 'platform.h',
                                       'Line' => '728',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value_u8',
                                                            'offset' => '0',
                                                            'type' => '135'
                                                          },
                                                   '1' => {
                                                            'name' => 'value_s8',
                                                            'offset' => '0',
                                                            'type' => '88093'
                                                          },
                                                   '2' => {
                                                            'name' => 'value_u16',
                                                            'offset' => '0',
                                                            'type' => '5660'
                                                          },
                                                   '3' => {
                                                            'name' => 'value_s16',
                                                            'offset' => '0',
                                                            'type' => '88105'
                                                          },
                                                   '4' => {
                                                            'name' => 'value_u32',
                                                            'offset' => '0',
                                                            'type' => '147'
                                                          },
                                                   '5' => {
                                                            'name' => 'value_s32',
                                                            'offset' => '0',
                                                            'type' => '88117'
                                                          }
                                                 },
                                       'Name' => 'union union_effecter_data_size',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '90130' => {
                                       'Header' => 'platform.h',
                                       'Line' => '744',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value_u8',
                                                            'offset' => '0',
                                                            'type' => '135'
                                                          },
                                                   '1' => {
                                                            'name' => 'value_s8',
                                                            'offset' => '0',
                                                            'type' => '88093'
                                                          },
                                                   '2' => {
                                                            'name' => 'value_u16',
                                                            'offset' => '0',
                                                            'type' => '5660'
                                                          },
                                                   '3' => {
                                                            'name' => 'value_s16',
                                                            'offset' => '0',
                                                            'type' => '88105'
                                                          },
                                                   '4' => {
                                                            'name' => 'value_u32',
                                                            'offset' => '0',
                                                            'type' => '147'
                                                          },
                                                   '5' => {
                                                            'name' => 'value_s32',
                                                            'offset' => '0',
                                                            'type' => '88117'
                                                          },
                                                   '6' => {
                                                            'name' => 'value_f32',
                                                            'offset' => '0',
                                                            'type' => '88358'
                                                          }
                                                 },
                                       'Name' => 'union union_range_field_format',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '90143' => {
                                       'Header' => 'platform.h',
                                       'Line' => '750',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '89172'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '16',
                                                            'type' => '5660'
                                                          },
                                                   '2' => {
                                                            'name' => 'effecter_id',
                                                            'offset' => '18',
                                                            'type' => '5660'
                                                          },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '20',
                                                            'type' => '5660'
                                                          },
                                                   '4' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '22',
                                                            'type' => '5660'
                                                          },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '24',
                                                            'type' => '5660'
                                                          },
                                                   '6' => {
                                                            'name' => 'effecter_semantic_id',
                                                            'offset' => '32',
                                                            'type' => '5660'
                                                          },
                                                   '7' => {
                                                            'name' => 'effecter_init',
                                                            'offset' => '34',
                                                            'type' => '135'
                                                          },
                                                   '8' => {
                                                            'name' => 'effecter_auxiliary_names',
                                                            'offset' => '35',
                                                            'type' => '34885'
                                                          },
                                                   '9' => {
                                                            'name' => 'base_unit',
                                                            'offset' => '36',
                                                            'type' => '135'
                                                          },
                                                   '10' => {
                                                             'name' => 'unit_modifier',
                                                             'offset' => '37',
                                                             'type' => '88093'
                                                           },
                                                   '11' => {
                                                             'name' => 'rate_unit',
                                                             'offset' => '38',
                                                             'type' => '135'
                                                           },
                                                   '12' => {
                                                             'name' => 'base_oem_unit_handle',
                                                             'offset' => '39',
                                                             'type' => '135'
                                                           },
                                                   '13' => {
                                                             'name' => 'aux_unit',
                                                             'offset' => '40',
                                                             'type' => '135'
                                                           },
                                                   '14' => {
                                                             'name' => 'aux_unit_modifier',
                                                             'offset' => '41',
                                                             'type' => '88093'
                                                           },
                                                   '15' => {
                                                             'name' => 'aux_rate_unit',
                                                             'offset' => '48',
                                                             'type' => '135'
                                                           },
                                                   '16' => {
                                                             'name' => 'aux_oem_unit_handle',
                                                             'offset' => '49',
                                                             'type' => '135'
                                                           },
                                                   '17' => {
                                                             'name' => 'is_linear',
                                                             'offset' => '50',
                                                             'type' => '34885'
                                                           },
                                                   '18' => {
                                                             'name' => 'effecter_data_size',
                                                             'offset' => '51',
                                                             'type' => '135'
                                                           },
                                                   '19' => {
                                                             'name' => 'resolution',
                                                             'offset' => '52',
                                                             'type' => '88358'
                                                           },
                                                   '20' => {
                                                             'name' => 'offset',
                                                             'offset' => '56',
                                                             'type' => '88358'
                                                           },
                                                   '21' => {
                                                             'name' => 'accuracy',
                                                             'offset' => '66',
                                                             'type' => '5660'
                                                           },
                                                   '22' => {
                                                             'name' => 'plus_tolerance',
                                                             'offset' => '68',
                                                             'type' => '135'
                                                           },
                                                   '23' => {
                                                             'name' => 'minus_tolerance',
                                                             'offset' => '69',
                                                             'type' => '135'
                                                           },
                                                   '24' => {
                                                             'name' => 'state_transition_interval',
                                                             'offset' => '70',
                                                             'type' => '88358'
                                                           },
                                                   '25' => {
                                                             'name' => 'transition_interval',
                                                             'offset' => '80',
                                                             'type' => '88358'
                                                           },
                                                   '26' => {
                                                             'name' => 'max_settable',
                                                             'offset' => '84',
                                                             'type' => '90025'
                                                           },
                                                   '27' => {
                                                             'name' => 'min_settable',
                                                             'offset' => '88',
                                                             'type' => '90025'
                                                           },
                                                   '28' => {
                                                             'name' => 'range_field_format',
                                                             'offset' => '98',
                                                             'type' => '135'
                                                           },
                                                   '29' => {
                                                             'name' => 'range_field_support',
                                                             'offset' => '99',
                                                             'type' => '344'
                                                           },
                                                   '30' => {
                                                             'name' => 'nominal_value',
                                                             'offset' => '100',
                                                             'type' => '90130'
                                                           },
                                                   '31' => {
                                                             'name' => 'normal_max',
                                                             'offset' => '104',
                                                             'type' => '90130'
                                                           },
                                                   '32' => {
                                                             'name' => 'normal_min',
                                                             'offset' => '114',
                                                             'type' => '90130'
                                                           },
                                                   '33' => {
                                                             'name' => 'rated_max',
                                                             'offset' => '118',
                                                             'type' => '90130'
                                                           },
                                                   '34' => {
                                                             'name' => 'rated_min',
                                                             'offset' => '128',
                                                             'type' => '90130'
                                                           }
                                                 },
                                       'Name' => 'struct pldm_numeric_effecter_value_pdr',
                                       'Size' => '84',
                                       'Type' => 'Struct'
                                     },
                          '90658' => {
                                       'BaseType' => '88625',
                                       'Name' => 'struct pldm_pdr_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '90670' => {
                                       'BaseType' => '88608',
                                       'Name' => 'pldm_pdr_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '90675' => {
                                       'BaseType' => '88880',
                                       'Name' => 'pldm_entity_node*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '92120' => {
                                       'BaseType' => '88537',
                                       'Name' => 'pldm_pdr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '92125' => {
                                       'BaseType' => '88779',
                                       'Name' => 'pldm_entity*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '92417' => {
                                       'BaseType' => '88525',
                                       'Name' => 'pldm_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '92427' => {
                                       'BaseType' => '89623',
                                       'Name' => 'struct pldm_state_sensor_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '92704' => {
                                       'BaseType' => '89777',
                                       'Name' => 'struct pldm_state_effecter_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '92955' => {
                                       'BaseType' => '88824',
                                       'Name' => 'pldm_entity_association_tree*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '93116' => {
                                       'BaseType' => '90143',
                                       'Name' => 'struct pldm_numeric_effecter_value_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '95218' => {
                                       'BaseType' => '88620',
                                       'Name' => 'pldm_pdr_record const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '108725' => {
                                        'BaseType' => '92125',
                                        'Name' => 'pldm_entity**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '109383' => {
                                        'BaseType' => '90675',
                                        'Name' => 'pldm_entity_node**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '115356' => {
                                        'BaseType' => '88893',
                                        'Name' => 'pldm_entity_node const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '121066' => {
                                        'BaseType' => '5581',
                                        'Header' => 'types.h',
                                        'Line' => '55',
                                        'Name' => '__uint_least16_t',
                                        'PrivateABI' => 1,
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '122065' => {
                                        'BaseType' => '121066',
                                        'Header' => 'uchar.h',
                                        'Line' => '51',
                                        'Name' => 'char16_t',
                                        'PrivateABI' => 1,
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '122891' => {
                                        'Header' => 'platform.h',
                                        'Line' => '329',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'PLDM_SENSOR_OP_STATE',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'PLDM_STATE_SENSOR_STATE',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'PLDM_NUMERIC_SENSOR_STATE',
                                                             'value' => '2'
                                                           }
                                                  },
                                        'Name' => 'enum sensor_event_class_states',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '122925' => {
                                        'BaseType' => '122891',
                                        'Name' => 'enum sensor_event_class_states const',
                                        'Size' => '4',
                                        'Type' => 'Const'
                                      },
                          '123387' => {
                                        'Header' => 'platform.h',
                                        'Line' => '643',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'state_set_id',
                                                             'offset' => '0',
                                                             'type' => '5660'
                                                           },
                                                    '1' => {
                                                             'name' => 'possible_states_size',
                                                             'offset' => '2',
                                                             'type' => '135'
                                                           },
                                                    '2' => {
                                                             'name' => 'states',
                                                             'offset' => '3',
                                                             'type' => '123449'
                                                           }
                                                  },
                                        'Name' => 'struct state_sensor_possible_states',
                                        'Size' => '4',
                                        'Type' => 'Struct'
                                      },
                          '123444' => {
                                        'BaseType' => '123387',
                                        'Name' => 'struct state_sensor_possible_states const',
                                        'Size' => '4',
                                        'Type' => 'Const'
                                      },
                          '123449' => {
                                        'BaseType' => '344',
                                        'Name' => 'bitfield8_t[1]',
                                        'Size' => '1',
                                        'Type' => 'Array'
                                      },
                          '124415' => {
                                        'Header' => 'platform.h',
                                        'Line' => '801',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'value_u8',
                                                             'offset' => '0',
                                                             'type' => '135'
                                                           },
                                                    '1' => {
                                                             'name' => 'value_s8',
                                                             'offset' => '0',
                                                             'type' => '88093'
                                                           },
                                                    '2' => {
                                                             'name' => 'value_u16',
                                                             'offset' => '0',
                                                             'type' => '5660'
                                                           },
                                                    '3' => {
                                                             'name' => 'value_s16',
                                                             'offset' => '0',
                                                             'type' => '88105'
                                                           },
                                                    '4' => {
                                                             'name' => 'value_u32',
                                                             'offset' => '0',
                                                             'type' => '147'
                                                           },
                                                    '5' => {
                                                             'name' => 'value_s32',
                                                             'offset' => '0',
                                                             'type' => '88117'
                                                           }
                                                  },
                                        'Name' => 'union union_sensor_data_size',
                                        'Size' => '4',
                                        'Type' => 'Union'
                                      },
                          '124428' => {
                                        'Header' => 'platform.h',
                                        'Line' => '808',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'record_handle',
                                                             'offset' => '0',
                                                             'type' => '147'
                                                           },
                                                    '1' => {
                                                             'name' => 'version',
                                                             'offset' => '4',
                                                             'type' => '135'
                                                           },
                                                    '2' => {
                                                             'name' => 'type',
                                                             'offset' => '5',
                                                             'type' => '135'
                                                           },
                                                    '3' => {
                                                             'name' => 'record_change_num',
                                                             'offset' => '6',
                                                             'type' => '5660'
                                                           },
                                                    '4' => {
                                                             'name' => 'length',
                                                             'offset' => '8',
                                                             'type' => '5660'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_value_pdr_hdr',
                                        'Size' => '12',
                                        'Type' => 'Struct'
                                      },
                          '124513' => {
                                        'Header' => 'platform.h',
                                        'Line' => '826',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'entity_instance_num',
                                                             'offset' => '0',
                                                             'type' => '5660'
                                                           },
                                                    '1' => {
                                                             'name' => 'entity_instance',
                                                             'offset' => '0',
                                                             'type' => '5660'
                                                           }
                                                  },
                                        'Name' => 'anon-union-platform.h-826',
                                        'Size' => '2',
                                        'Type' => 'Union'
                                      },
                          '124548' => {
                                        'Header' => 'platform.h',
                                        'Line' => '821',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'hdr',
                                                             'offset' => '0',
                                                             'type' => '124428'
                                                           },
                                                    '1' => {
                                                             'name' => 'terminus_handle',
                                                             'offset' => '18',
                                                             'type' => '5660'
                                                           },
                                                    '2' => {
                                                             'name' => 'sensor_id',
                                                             'offset' => '20',
                                                             'type' => '5660'
                                                           },
                                                    '3' => {
                                                             'name' => 'entity_type',
                                                             'offset' => '22',
                                                             'type' => '5660'
                                                           },
                                                    '4' => {
                                                             'name' => 'unnamed0',
                                                             'offset' => '24',
                                                             'type' => '124513'
                                                           },
                                                    '5' => {
                                                             'name' => 'container_id',
                                                             'offset' => '32',
                                                             'type' => '5660'
                                                           },
                                                    '6' => {
                                                             'name' => 'sensor_init',
                                                             'offset' => '34',
                                                             'type' => '135'
                                                           },
                                                    '7' => {
                                                             'name' => 'sensor_auxiliary_names_pdr',
                                                             'offset' => '35',
                                                             'type' => '34885'
                                                           },
                                                    '8' => {
                                                             'name' => 'base_unit',
                                                             'offset' => '36',
                                                             'type' => '135'
                                                           },
                                                    '9' => {
                                                             'name' => 'unit_modifier',
                                                             'offset' => '37',
                                                             'type' => '88093'
                                                           },
                                                    '10' => {
                                                              'name' => 'rate_unit',
                                                              'offset' => '38',
                                                              'type' => '135'
                                                            },
                                                    '11' => {
                                                              'name' => 'base_oem_unit_handle',
                                                              'offset' => '39',
                                                              'type' => '135'
                                                            },
                                                    '12' => {
                                                              'name' => 'aux_unit',
                                                              'offset' => '40',
                                                              'type' => '135'
                                                            },
                                                    '13' => {
                                                              'name' => 'aux_unit_modifier',
                                                              'offset' => '41',
                                                              'type' => '88093'
                                                            },
                                                    '14' => {
                                                              'name' => 'aux_rate_unit',
                                                              'offset' => '48',
                                                              'type' => '135'
                                                            },
                                                    '15' => {
                                                              'name' => 'rel',
                                                              'offset' => '49',
                                                              'type' => '135'
                                                            },
                                                    '16' => {
                                                              'name' => 'aux_oem_unit_handle',
                                                              'offset' => '50',
                                                              'type' => '135'
                                                            },
                                                    '17' => {
                                                              'name' => 'is_linear',
                                                              'offset' => '51',
                                                              'type' => '34885'
                                                            },
                                                    '18' => {
                                                              'name' => 'sensor_data_size',
                                                              'offset' => '52',
                                                              'type' => '135'
                                                            },
                                                    '19' => {
                                                              'name' => 'resolution',
                                                              'offset' => '54',
                                                              'type' => '88358'
                                                            },
                                                    '20' => {
                                                              'name' => 'offset',
                                                              'offset' => '64',
                                                              'type' => '88358'
                                                            },
                                                    '21' => {
                                                              'name' => 'accuracy',
                                                              'offset' => '68',
                                                              'type' => '5660'
                                                            },
                                                    '22' => {
                                                              'name' => 'plus_tolerance',
                                                              'offset' => '70',
                                                              'type' => '135'
                                                            },
                                                    '23' => {
                                                              'name' => 'minus_tolerance',
                                                              'offset' => '71',
                                                              'type' => '135'
                                                            },
                                                    '24' => {
                                                              'name' => 'hysteresis',
                                                              'offset' => '72',
                                                              'type' => '124415'
                                                            },
                                                    '25' => {
                                                              'name' => 'supported_thresholds',
                                                              'offset' => '82',
                                                              'type' => '344'
                                                            },
                                                    '26' => {
                                                              'name' => 'threshold_and_hysteresis_volatility',
                                                              'offset' => '83',
                                                              'type' => '344'
                                                            },
                                                    '27' => {
                                                              'name' => 'state_transition_interval',
                                                              'offset' => '86',
                                                              'type' => '88358'
                                                            },
                                                    '28' => {
                                                              'name' => 'update_interval',
                                                              'offset' => '96',
                                                              'type' => '88358'
                                                            },
                                                    '29' => {
                                                              'name' => 'max_readable',
                                                              'offset' => '100',
                                                              'type' => '124415'
                                                            },
                                                    '30' => {
                                                              'name' => 'min_readable',
                                                              'offset' => '104',
                                                              'type' => '124415'
                                                            },
                                                    '31' => {
                                                              'name' => 'range_field_format',
                                                              'offset' => '114',
                                                              'type' => '135'
                                                            },
                                                    '32' => {
                                                              'name' => 'range_field_support',
                                                              'offset' => '115',
                                                              'type' => '344'
                                                            },
                                                    '33' => {
                                                              'name' => 'nominal_value',
                                                              'offset' => '118',
                                                              'type' => '90130'
                                                            },
                                                    '34' => {
                                                              'name' => 'normal_max',
                                                              'offset' => '128',
                                                              'type' => '90130'
                                                            },
                                                    '35' => {
                                                              'name' => 'normal_min',
                                                              'offset' => '132',
                                                              'type' => '90130'
                                                            },
                                                    '36' => {
                                                              'name' => 'warning_high',
                                                              'offset' => '136',
                                                              'type' => '90130'
                                                            },
                                                    '37' => {
                                                              'name' => 'warning_low',
                                                              'offset' => '146',
                                                              'type' => '90130'
                                                            },
                                                    '38' => {
                                                              'name' => 'critical_high',
                                                              'offset' => '150',
                                                              'type' => '90130'
                                                            },
                                                    '39' => {
                                                              'name' => 'critical_low',
                                                              'offset' => '256',
                                                              'type' => '90130'
                                                            },
                                                    '40' => {
                                                              'name' => 'fatal_high',
                                                              'offset' => '260',
                                                              'type' => '90130'
                                                            },
                                                    '41' => {
                                                              'name' => 'fatal_low',
                                                              'offset' => '264',
                                                              'type' => '90130'
                                                            }
                                                  },
                                        'Name' => 'struct pldm_numeric_sensor_value_pdr',
                                        'Size' => '112',
                                        'Type' => 'Struct'
                                      },
                          '125141' => {
                                        'BaseType' => '122065',
                                        'Header' => 'platform.h',
                                        'Line' => '869',
                                        'Name' => 'pldm_utf16be',
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '125154' => {
                                        'Header' => 'platform.h',
                                        'Line' => '871',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tag',
                                                             'offset' => '0',
                                                             'type' => '5631'
                                                           },
                                                    '1' => {
                                                             'name' => 'name',
                                                             'offset' => '8',
                                                             'type' => '125196'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_entity_auxiliary_name',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '125196' => {
                                        'BaseType' => '125141',
                                        'Name' => 'pldm_utf16be*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '125201' => {
                                        'Header' => 'platform.h',
                                        'Line' => '881',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'hdr',
                                                             'offset' => '0',
                                                             'type' => '124428'
                                                           },
                                                    '1' => {
                                                             'name' => 'container',
                                                             'offset' => '18',
                                                             'type' => '88779'
                                                           },
                                                    '2' => {
                                                             'name' => 'shared_name_count',
                                                             'offset' => '24',
                                                             'type' => '135'
                                                           },
                                                    '3' => {
                                                             'name' => 'name_string_count',
                                                             'offset' => '25',
                                                             'type' => '135'
                                                           },
                                                    '4' => {
                                                             'name' => 'names',
                                                             'offset' => '36',
                                                             'type' => '125315'
                                                           },
                                                    '5' => {
                                                             'name' => 'auxiliary_name_data_size',
                                                             'offset' => '50',
                                                             'type' => '164'
                                                           },
                                                    '6' => {
                                                             'name' => 'auxiliary_name_data',
                                                             'offset' => '64',
                                                             'type' => '125320'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_entity_auxiliary_names_pdr',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '125315' => {
                                        'BaseType' => '125154',
                                        'Name' => 'struct pldm_entity_auxiliary_name*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '125320' => {
                                        'BaseType' => '128',
                                        'Name' => 'char[]',
                                        'Size' => '8',
                                        'Type' => 'Array'
                                      },
                          '125335' => {
                                        'Header' => 'platform.h',
                                        'Line' => '911',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'state_set_id',
                                                             'offset' => '0',
                                                             'type' => '5660'
                                                           },
                                                    '1' => {
                                                             'name' => 'possible_states_size',
                                                             'offset' => '2',
                                                             'type' => '135'
                                                           },
                                                    '2' => {
                                                             'name' => 'states',
                                                             'offset' => '3',
                                                             'type' => '123449'
                                                           }
                                                  },
                                        'Name' => 'struct state_effecter_possible_states',
                                        'Size' => '4',
                                        'Type' => 'Struct'
                                      },
                          '125392' => {
                                        'BaseType' => '125335',
                                        'Name' => 'struct state_effecter_possible_states const',
                                        'Size' => '4',
                                        'Type' => 'Const'
                                      },
                          '125397' => {
                                        'Header' => 'platform.h',
                                        'Line' => '959',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'set_request',
                                                             'offset' => '0',
                                                             'type' => '135'
                                                           },
                                                    '1' => {
                                                             'name' => 'effecter_state',
                                                             'offset' => '1',
                                                             'type' => '135'
                                                           }
                                                  },
                                        'Name' => 'struct state_field_for_state_effecter_set',
                                        'Size' => '2',
                                        'Type' => 'Struct'
                                      },
                          '125440' => {
                                        'BaseType' => '125397',
                                        'Header' => 'platform.h',
                                        'Line' => '962',
                                        'Name' => 'set_effecter_state_field',
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '125453' => {
                                        'Header' => 'platform.h',
                                        'Line' => '968',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'sensor_op_state',
                                                             'offset' => '0',
                                                             'type' => '135'
                                                           },
                                                    '1' => {
                                                             'name' => 'present_state',
                                                             'offset' => '1',
                                                             'type' => '135'
                                                           },
                                                    '2' => {
                                                             'name' => 'previous_state',
                                                             'offset' => '2',
                                                             'type' => '135'
                                                           },
                                                    '3' => {
                                                             'name' => 'event_state',
                                                             'offset' => '3',
                                                             'type' => '135'
                                                           }
                                                  },
                                        'Name' => 'struct state_field_for_get_state_sensor_readings',
                                        'Size' => '4',
                                        'Type' => 'Struct'
                                      },
                          '125524' => {
                                        'BaseType' => '125453',
                                        'Header' => 'platform.h',
                                        'Line' => '976',
                                        'Name' => 'get_sensor_state_field',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '125537' => {
                                        'Header' => 'platform.h',
                                        'Line' => '982',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'effecter_op_state',
                                                             'offset' => '0',
                                                             'type' => '135'
                                                           },
                                                    '1' => {
                                                             'name' => 'pending_state',
                                                             'offset' => '1',
                                                             'type' => '135'
                                                           },
                                                    '2' => {
                                                             'name' => 'present_state',
                                                             'offset' => '2',
                                                             'type' => '135'
                                                           }
                                                  },
                                        'Name' => 'struct state_field_for_get_state_effecter_states',
                                        'Size' => '3',
                                        'Type' => 'Struct'
                                      },
                          '125594' => {
                                        'BaseType' => '125537',
                                        'Header' => 'platform.h',
                                        'Line' => '986',
                                        'Name' => 'get_effecter_state_field',
                                        'Size' => '3',
                                        'Type' => 'Typedef'
                                      },
                          '125680' => {
                                        'Header' => 'platform.h',
                                        'Line' => '1002',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'completion_code',
                                                             'offset' => '0',
                                                             'type' => '135'
                                                           },
                                                    '1' => {
                                                             'name' => 'repository_state',
                                                             'offset' => '1',
                                                             'type' => '135'
                                                           },
                                                    '2' => {
                                                             'name' => 'update_time',
                                                             'offset' => '2',
                                                             'type' => '38728'
                                                           },
                                                    '3' => {
                                                             'name' => 'oem_update_time',
                                                             'offset' => '21',
                                                             'type' => '38728'
                                                           },
                                                    '4' => {
                                                             'name' => 'record_count',
                                                             'offset' => '40',
                                                             'type' => '147'
                                                           },
                                                    '5' => {
                                                             'name' => 'repository_size',
                                                             'offset' => '50',
                                                             'type' => '147'
                                                           },
                                                    '6' => {
                                                             'name' => 'largest_record_size',
                                                             'offset' => '54',
                                                             'type' => '147'
                                                           },
                                                    '7' => {
                                                             'name' => 'data_transfer_handle_timeout',
                                                             'offset' => '64',
                                                             'type' => '135'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_pdr_repository_info_resp',
                                        'Size' => '41',
                                        'Type' => 'Struct'
                                      },
                          '125823' => {
                                        'Header' => 'platform.h',
                                        'Line' => '1019',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'completion_code',
                                                             'offset' => '0',
                                                             'type' => '135'
                                                           },
                                                    '1' => {
                                                             'name' => 'next_record_handle',
                                                             'offset' => '1',
                                                             'type' => '147'
                                                           },
                                                    '2' => {
                                                             'name' => 'next_data_transfer_handle',
                                                             'offset' => '5',
                                                             'type' => '147'
                                                           },
                                                    '3' => {
                                                             'name' => 'transfer_flag',
                                                             'offset' => '9',
                                                             'type' => '135'
                                                           },
                                                    '4' => {
                                                             'name' => 'response_count',
                                                             'offset' => '16',
                                                             'type' => '5660'
                                                           },
                                                    '5' => {
                                                             'name' => 'record_data',
                                                             'offset' => '18',
                                                             'type' => '962'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_get_pdr_resp',
                                        'Size' => '13',
                                        'Type' => 'Struct'
                                      },
                          '126323' => {
                                        'Header' => 'platform.h',
                                        'Line' => '1131',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'completion_code',
                                                             'offset' => '0',
                                                             'type' => '135'
                                                           },
                                                    '1' => {
                                                             'name' => 'comp_effecter_count',
                                                             'offset' => '1',
                                                             'type' => '135'
                                                           },
                                                    '2' => {
                                                             'name' => 'field',
                                                             'offset' => '2',
                                                             'type' => '126380'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_get_state_effecter_states_resp',
                                        'Size' => '26',
                                        'Type' => 'Struct'
                                      },
                          '126380' => {
                                        'BaseType' => '125594',
                                        'Name' => 'get_effecter_state_field[8]',
                                        'Size' => '24',
                                        'Type' => 'Array'
                                      },
                          '126396' => {
                                        'Header' => 'platform.h',
                                        'Line' => '1141',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'sensor_id',
                                                             'offset' => '0',
                                                             'type' => '5660'
                                                           },
                                                    '1' => {
                                                             'name' => 'sensor_event_class_type',
                                                             'offset' => '2',
                                                             'type' => '135'
                                                           },
                                                    '2' => {
                                                             'name' => 'event_class',
                                                             'offset' => '3',
                                                             'type' => '962'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_sensor_event_data',
                                        'Size' => '4',
                                        'Type' => 'Struct'
                                      },
                          '126510' => {
                                        'Header' => 'platform.h',
                                        'Line' => '1181',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'format_version',
                                                             'offset' => '0',
                                                             'type' => '135'
                                                           },
                                                    '1' => {
                                                             'name' => 'event_id',
                                                             'offset' => '2',
                                                             'type' => '5660'
                                                           },
                                                    '2' => {
                                                             'name' => 'data_transfer_handle',
                                                             'offset' => '4',
                                                             'type' => '147'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_message_poll_event',
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '126567' => {
                                        'BaseType' => '126510',
                                        'Name' => 'struct pldm_message_poll_event const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '126572' => {
                                        'Header' => 'platform.h',
                                        'Line' => '1191',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'format_version',
                                                             'offset' => '0',
                                                             'type' => '135'
                                                           },
                                                    '1' => {
                                                             'name' => 'format_type',
                                                             'offset' => '1',
                                                             'type' => '135'
                                                           },
                                                    '2' => {
                                                             'name' => 'event_data_length',
                                                             'offset' => '2',
                                                             'type' => '5660'
                                                           },
                                                    '3' => {
                                                             'name' => 'event_data',
                                                             'offset' => '4',
                                                             'type' => '126643'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_platform_cper_event',
                                        'Size' => '4',
                                        'Type' => 'Struct'
                                      },
                          '126643' => {
                                        'BaseType' => '135',
                                        'Name' => 'uint8_t[]',
                                        'Size' => '8',
                                        'Type' => 'Array'
                                      },
                          '126799' => {
                                        'Header' => 'platform.h',
                                        'Line' => '1251',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'event_data_format',
                                                             'offset' => '0',
                                                             'type' => '135'
                                                           },
                                                    '1' => {
                                                             'name' => 'number_of_change_records',
                                                             'offset' => '1',
                                                             'type' => '135'
                                                           },
                                                    '2' => {
                                                             'name' => 'change_records',
                                                             'offset' => '2',
                                                             'type' => '962'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_pdr_repository_chg_event_data',
                                        'Size' => '3',
                                        'Type' => 'Struct'
                                      },
                          '127423' => {
                                        'BaseType' => '126572',
                                        'Name' => 'struct pldm_platform_cper_event*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '129158' => {
                                        'BaseType' => '125201',
                                        'Name' => 'struct pldm_entity_auxiliary_names_pdr*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '134409' => {
                                        'BaseType' => '126323',
                                        'Name' => 'struct pldm_get_state_effecter_states_resp*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '162645' => {
                                        'BaseType' => '2697',
                                        'Name' => 'size_t*const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '163413' => {
                                        'BaseType' => '126567',
                                        'Name' => 'struct pldm_message_poll_event const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '164339' => {
                                        'BaseType' => '126510',
                                        'Name' => 'struct pldm_message_poll_event*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '165333' => {
                                        'BaseType' => '165343',
                                        'Name' => 'uint32_t const*const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '165338' => {
                                        'BaseType' => '159',
                                        'Name' => 'uint32_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '165343' => {
                                        'BaseType' => '165338',
                                        'Name' => 'uint32_t const*const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '165348' => {
                                        'BaseType' => '126799',
                                        'Name' => 'struct pldm_pdr_repository_chg_event_data*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '192778' => {
                                        'BaseType' => '124548',
                                        'Name' => 'struct pldm_numeric_sensor_value_pdr*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '205161' => {
                                        'BaseType' => '126396',
                                        'Name' => 'struct pldm_sensor_event_data*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '205166' => {
                                        'BaseType' => '205161',
                                        'Name' => 'struct pldm_sensor_event_data*const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '207316' => {
                                        'BaseType' => '125524',
                                        'Name' => 'get_sensor_state_field*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '212413' => {
                                        'BaseType' => '125823',
                                        'Name' => 'struct pldm_get_pdr_resp*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '216483' => {
                                        'BaseType' => '125680',
                                        'Name' => 'struct pldm_pdr_repository_info_resp*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '221998' => {
                                        'BaseType' => '125440',
                                        'Name' => 'set_effecter_state_field*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '222979' => {
                                        'BaseType' => '92427',
                                        'Name' => 'struct pldm_state_sensor_pdr*const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '222984' => {
                                        'BaseType' => '123444',
                                        'Name' => 'struct state_sensor_possible_states const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '222989' => {
                                        'BaseType' => '222984',
                                        'Name' => 'struct state_sensor_possible_states const*const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '223389' => {
                                        'BaseType' => '92704',
                                        'Name' => 'struct pldm_state_effecter_pdr*const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '223394' => {
                                        'BaseType' => '125392',
                                        'Name' => 'struct state_effecter_possible_states const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '223399' => {
                                        'BaseType' => '223394',
                                        'Name' => 'struct state_effecter_possible_states const*const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '226255' => {
                                        'Line' => '19',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'prev',
                                                             'offset' => '0',
                                                             'type' => '4841'
                                                           },
                                                    '1' => {
                                                             'name' => 'allocations',
                                                             'offset' => '4',
                                                             'type' => '147'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_tid_state',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Source' => 'instance-id.c',
                                        'Type' => 'Struct'
                                      },
                          '226294' => {
                                        'Line' => '24',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'state',
                                                             'offset' => '0',
                                                             'type' => '226336'
                                                           },
                                                    '1' => {
                                                             'name' => 'lock_db_fd',
                                                             'offset' => '8264',
                                                             'type' => '100'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_instance_db',
                                        'PrivateABI' => 1,
                                        'Size' => '2052',
                                        'Source' => 'instance-id.c',
                                        'Type' => 'Struct'
                                      },
                          '226336' => {
                                        'BaseType' => '226255',
                                        'Name' => 'struct pldm_tid_state[256]',
                                        'Size' => '2048',
                                        'Type' => 'Array'
                                      },
                          '226892' => {
                                        'BaseType' => '226294',
                                        'Name' => 'struct pldm_instance_db*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '227279' => {
                                        'BaseType' => '4841',
                                        'Name' => 'pldm_instance_id_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '227455' => {
                                        'BaseType' => '226892',
                                        'Name' => 'struct pldm_instance_db**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '228247' => {
                                        'BaseType' => '135',
                                        'Header' => 'pldm.h',
                                        'Line' => '13',
                                        'Name' => 'mctp_eid_t',
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '228362' => {
                                        'BaseType' => '4938',
                                        'Header' => 'pldm.h',
                                        'Line' => '30',
                                        'Name' => 'pldm_requester_rc_t',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '228380' => {
                                        'Line' => '26',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'transport',
                                                             'offset' => '0',
                                                             'type' => '228453'
                                                           },
                                                    '1' => {
                                                             'name' => 'socket',
                                                             'offset' => '64',
                                                             'type' => '100'
                                                           },
